OdDAI.ADB_Value.op_Implicit~System.Boolean
\details
The cast to boolean operator for the attribute data block value object.
\returns
The attribute data block value converted to a boolean value.
If the attribute data block value can't be converted into the boolean data type, the operator throws an exception.

OdDAI.ADB_Value.op_Implicit~System.Int32
\details
The cast to integer operator for the attribute data block value object.
\returns
The attribute data block value converted to a signed integer value.
If the attribute data block value can't be converted into the signed integer data type, the operator throws an exception.